# coding:utf-8
try:
    a = int('asx')
except Exception as e:
    print(e)
finally:
    print('hahahhaha')
p = {
  "永续债": "None",
  "专项储备": "None",
  "资产总计": "153,634,258,937.25",
  "股东权益合计": "53,103,871,667.01",
  "股本": "4,513,631,772.00",
  "盈余公积": "1,875,472,664.24",
  "其他非流动负债": "None",
  "其他权益工具": "95,325,455.65",
  "减：库存股": "None",
  "商誉": "None",
  "负债合计": "100,530,387,270.24",
  "其他非流动资产": "165,257,899.47",
  "资本公积": "3,615,861,962.43",
  "非流动负债合计": "31,914,215,158.07",
  "非流动资产合计": "28,889,126,516.60",
  "负债和股东权益总计": "153,634,258,937.25",
  "未分配利润": "26,886,865,734.15",
  "少数股东权益": "15,672,965,316.04",
  "其他综合收益": "443,748,762.50",
  "一般风险准备": "None",
  "递延所得税资产": "1,639,354,376.78",
  "其中：优先股": "None",
  "归属于母公司股东权益合计": "37,430,906,350.97",
  "长期待摊费用": "77,207,132.42",
  "其他流动资产": "6,773,981,164.49",
  "递延所得税负债": "3,387,541,847.86",
  "长期应付款": "None",
  "一年内到期的非流动负债": "7,246,382,077.30",
  "拆入资金": "None",
  "专项应付款": "None",
  "固定资产清理": "None",
  "持有待售负债": "None",
  "其他应收款": "20,696,960,201.73",
  "衍生金融负债": "None",
  "卖出回购金融资产款": "None",
  "代理承销证券款": "None",
  "应收利息": "None",
  "应收分保账款": "None",
  "油气资产": "None",
  "流动负债合计": "68,616,172,112.17",
  "流动资产合计": "124,745,132,420.65",
  "在建工程": "None",
  "递延收益": "None",
  "应收保费": "None",
  "应付利息": "400,576,233.59",
  "吸收存款及同业存放": "None",
  "以公允价值计量且其变动计入当期损益的金融资产": "None",
  "一年内到期的非流动资产": "None",
  "应收票据": "None",
  "无形资产": "38,949,751.89",
  "长期应收款": "None",
  "结算备付金": "None",
  "预计负债": "None",
  "拆出资金": "None",
  "其他流动负债": "None",
  "应收分保合同准备金": "None",
  "应付账款": "13,394,774,936.84",
  "投资性房地产": "14,773,540,740.00",
  "生产性生物资产": "None",
  "持有至到期投资": "None",
  "固定资产": "1,195,196,652.04",
  "应付债券": "18,417,982,920.89",
  "以公允价值计量且其变动计入当期损益的金融负债": "None",
  "持有待售资产": "None",
  "短期借款": "861,368,165.77",
  "应收股利": "None",
  "存货": "71,776,661,992.42",
  "预付款项": "3,871,387,617.25",
  "工程物资": "None",
  "开发支出": "None",
  "应交税费": "2,442,414,754.27",
  "应付分保账款": "None",
  "应付股利": "46,918,652.93",
  "货币资金": "21,564,986,458.13",
  "代理买卖证券款": "None",
  "发放贷款及垫款": "924,019,497.33",
  "其他应付款": "15,850,250,947.81",
  "长期应付职工薪酬": "None",
  "长期股权投资": "9,882,742,980.77",
  "预收款项": "27,485,605,543.53",
  "应收账款": "61,154,986.63",
  "应付手续费及佣金": "None",
  "衍生金融资产": "None",
  "应付职工薪酬": "875,589,128.73",
  "可供出售金融资产": "192,857,485.90",
  "买入返售金融资产": "None",
  "向中央银行借款": "None",
  "长期借款": "10,108,690,389.32",
  "保险合同准备金": "None",
  "应付票据": "12,291,671.40"}

pq = {"永续债": "None","专项储备": "None","资产总计": "207,942,066,457.45","股东权益合计": "57,955,964,898.28","股本": "4,514,583,572.00","盈余公积": "2,174,040,296.18","其他非流动负债": "2,541,500,000.00","其他权益工具": "84,635,169.54","减：库存股": "None","商誉": "None","负债合计": "149,986,101,559.17","其他非流动资产": "1,086,850,000.00","资本公积": "3,455,701,136.44","非流动负债合计": "45,492,037,133.30","非流动资产合计": "37,965,595,605.90","负债和股东权益总计": "207,942,066,457.45","未分配利润": "30,271,432,294.23","少数股东权益": "17,191,906,948.89","其他综合收益": "263,665,481.00","一般风险准备": "None","递延所得税资产": "2,241,350,996.94","其中：优先股": "None","归属于母公司股东权益合计": "40,764,057,949.39","长期待摊费用": "65,313,970.16","其他流动资产": "5,139,636,957.44","递延所得税负债": "3,548,090,493.50","长期应付款": "None","一年内到期的非流动负债": "11,059,211,960.90","拆入资金": "None","专项应付款": "None","固定资产清理": "None","持有待售负债": "None","其他应收款": "49,681,122,300.09","衍生金融负债": "None","卖出回购金融资产款": "None","代理承销证券款": "None","应收利息": "None","应收分保账款": "None","油气资产": "None","流动负债合计": "104,494,064,425.87","流动资产合计": "169,976,470,851.55","在建工程": "None","递延收益": "None","应收保费": "None","应付利息": "541,625,449.45","吸收存款及同业存放": "None","以公允价值计量且其变动计入当期损益的金融资产": "None","一年内到期的非流动资产": "None","应收票据": "None","无形资产": "48,075,569.71","长期应收款": "None","结算备付金": "None","预计负债": "None","拆出资金": "None","其他流动负债": "None","应收分保合同准备金": "None","应付账款": "9,954,085,901.55","投资性房地产": "16,317,595,007.00","生产性生物资产": "None","持有至到期投资": "None","固定资产": "1,123,163,641.16","应付债券": "22,039,610,313.28","以公允价值计量且其变动计入当期损益的金融负债": "None","持有待售资产": "None","短期借款": "2,350,969,617.41","应收股利": "35,000,000.00","存货": "84,183,097,866.10","预付款项": "3,469,476,069.23","工程物资": "None","开发支出": "None","应交税费": "2,046,082,803.08","应付分保账款": "None","应付股利": "30,505,421.60","货币资金": "27,406,030,533.77","代理买卖证券款": "None","发放贷款及垫款": "1,473,358,811.91","其他应付款": "19,086,417,248.64","长期应付职工薪酬": "None","长期股权投资": "15,406,356,064.42","预收款项": "57,948,241,014.05","应收账款": "62,107,124.92","应付手续费及佣金": "None","衍生金融资产": "None","应付职工薪酬": "1,476,925,009.19","可供出售金融资产": "203,531,544.60","买入返售金融资产": "None","向中央银行借款": "None","长期借款": "17,362,836,326.52","保险合同准备金": "None","应付票据": "None"}

print(len(p.keys()))
print(len(pq.keys()))
import xlwt
wbk = xlwt.Workbook()
sheet = wbk.add_sheet('sheet1')
j = 0
for i in p.keys():

    sheet.write(j,1,i)
    j+=1
wbk.save('kk.xls')
